OGO12/src/Documents/УстановкаЦенНаРаботы/УстановкаЦенНаРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЦенНаРаботы</name>
  <registerRecords>InformationRegister.Прейскурант</registerRecords>
  <tabularSections>
    <name>Прейскурант</name>
    <attributes>
      <name>ВидРабот</name>
      <type>
        <types>CatalogRef.ВидыРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>V_RABOT</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CODE</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>D_START</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

OGO12/src/InformationRegisters/Прейскурант/Прейскурант.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
	<name>Прейскурант</name>
	<informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
	<writeMode>RecorderSubordinate</writeMode>
	<resources>
		<name>Стоимость</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>11</precision>
				<scale>2</scale>
			</numberQualifiers>
		</type>
	</resources>
	<dimensions>
		<name>ВидРабот</name>
		<type>
			<types>CatalogRef.ВидыРабот</types>
		</type>
	</dimensions>
</mdclass:InformationRegister>

OGO12/src/Documents/УстановкаЦенНаРаботы/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр Прейскурант
	Движения.Прейскурант.Записывать = Истина;
	Для Каждого ТекСтрокаПрейскурант из Прейскурант Цикл
		Движение = Движения.Прейскурант.Добавить();
		Движение.ВидРабот = ТекСтрокаПрейскурант.ВидРабот;
		Движение.Стоимость = ТекСтрокаПрейскурант.Цена;
		Движение.Период = ЭтотОбъект.Дата;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
